--1. tblInsa. 남자 급여(기본급+수당)을 (내림차순)순위대로 가져오시오. (이름, 부서, 직위, 급여, 순위 출력)


--2. tblInsa. 여자 급여(기본급+수당)을 (오름차순)순위대로 가져오시오. (이름, 부서, 직위, 급여, 순위 출력)

--3. tblInsa. 여자 인원수가 가장 많은 부서 및 인원수 가져오시오.
--로우넘 3번 문제에서 가장 많은 부서가 2개 나오는데 그 중 아무거나 가져와도 됩니다~

--4. tblInsa. 지역별 인원수 (내림차순)순위를 가져오시오.(city, 인원수)

--5. tblInsa. 부서별 인원수가 가장 많은 부서 및 인원수 출력.

--6. tblInsa. 남자 급여(기본급+수당)을 (내림차순) 3~5등까지 가져오시오. (이름, 부서, 직위, 급여, 순위 출력)

--7. tblInsa. 입사일이 빠른 순서로 5순위까지만 가져오시오.



--8. tblhousekeeping. 지출 내역(가격 * 수량) 중 가장 많은 금액을 지출한 내역 3가지를 가져오시오.

--9. tblinsa. 평균 급여 2위인 부서에 속한 직원들을 가져오시오.

--10. tbltodo. 등록 후 가장 빠르게 완료한 할일을 순서대로 5개 가져오시오.

--32. tblInsa. 남자 직원 중에서 급여를 3번째로 많이 받는 직원과 9번째로 많이 받는 직원의 급여 차액은 얼마?

--70. employees, departments. 커미션(commission_pct)을 가장 많이 받은 상위 4명의 부서명(department_name), 사원명 (first_name), 급여(salary), 커미션(commission_pct) 정보를 가져오시오. 결과는 커미션 을 많이 받는 순서로 가져오되 동일한 커미션에 대해서는 급여가 높은 사원을 먼저 정렬하시오.



--72. tblTodo. 등록 후 가장 빠르게 완료한 할일을 순서대로 상위 5개를 가져오시오.